{
    "posts": [
      { "id": 1, "title": "json-server", "author": "typicode" }
    ],
    "comments": [
      { "id": 1, "body": "some comment", "postId": 1 }
    ],
    "profile": { "name": "typicode" }
  }

  {
    "status": "ok",
    "totalResults": 70,
    "articles": [
      {
        "source": {
          "id": null,
          "name": "Thestatesman.com"
        },
        "author": "SNS Web",
        "title": "‘Olympics in 2021 unrealistic unless COVID-19 vaccine found’ - The Statesman",
        "description": "Olympics is not the only sporting tournament to be pushed back because of the dreaded coronavirus pandemic and high-profile tournaments including the cash-rich Indian Premier League (IPL) have been affected.",
        "url": "https://www.thestatesman.com/sports/olympics-in-2021-unrealistic-unless-covid-19-vaccine-found1502879079-1502879079.html",
        "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2020/03/Tokyo2020.jpg",
        "publishedAt": "2020-04-19T14:41:24Z",
        "content": "Holding the Tokyo Olympics any time before a vaccine is found will be “very unrealistic,” according to a leading global health expert. Professor Devi Sridhar said that the development of the vaccine will be key to when the Olympics can be held.\r\nSridhar, howe… [+1886 chars]"
      },
      
        "source": {
          "id": null,
          "name": "times.com"
        },
        "author": "",
        "title": "Covid-19: Staying at home and want to use AC? Here’s what you need to know - Hindustan Times",
        "description": "A recent study in China suggested that air conditioning aided the transmission of coronavirus infection between people in a restaurant.",
        "url": "",
        "urlToImage": "",
        "publishedAt": "2020-04-19T04:36:11Z",
        "content": "As coronavirus disease Covid-19 spreads rapidly, there is a barrage of information floating along with it on what should be used and what shouldn’t to check the spread of the disease.\r\nAmong such information is the use of air conditioners (ACs) - many on the … [+2178 chars]"
      }
    ]
  }
